from fuzzywuzzy import fuzz
from fuzzywuzzy import process

uncensured_words = {"хуй", "хуи", "пиздец", "пизда", "ебать", "ебал", "ахуеть", "охуеть", "опиздохуеть", "блять",
                        "бля", "блядь", "бляздец", "гандон", "гондон", "нахуй", "нахуя", "разъебать", "разъебанный",
                        "ёбанный", "ебанный", "наебать", "уебок", "уёбок", "уебать", "хуесос", "похуй", "нихуя", "охуенно",
                        "охуенный", "охуенная", "охуенное", "хуесосик", "хуесосина", "хуесосище", "долбаёб", "долбаеб",
                        "далбаеб", "далбаёб", "ебало", "ебала", "залупа", "блядина", "залупы", "блядины", "еблан",
                        "еблана", "пиздопротивный", "пиздопротивно", "пиздопротивное", "пиздопротивная", "схуя",
                        "схуяли", "идинахуй", "динахуй", "динаху", "зуй", "еби", "ебите", "ебитесь", "ебали", "ебала",
                        "заебали", "заебли", "заебала", "заебла", "заеб", "заебал", "уебская", "уёбская", "уебский",
                        "уёбский", "злоебучий", "злоебучая", "злоебучее", "злоебучие", "нахуячил", "нахуячить",
                        "нахуячила", "нахуячило", "еблет", "хуепутала", "еблетом", "еблета", "хуепутало", "хуепуталом",
                        "захуячил", "захуячить", "захуячила", "захуячило", "пидор", "пидора", "пидорас", "пидораса",
                        "спиздить", "спиздил", "спиздила", "спиздило", "упиздил", "упиздила", "упидить", "упиздило"}
words = ["спиздил", "анон", "брать", "ахуеть", "хуй", "заебали", "уехать", "бана", "убрать", "билета", "обученная"]

for word in words:
    match, score = process.extractOne(word, uncensured_words, scorer=fuzz.WRatio)
    print(word, match, score)
